<?php

use Illuminate\Database\Seeder;

class CoursesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
//    	DB::table('courses')->truncate();
		
		$arr[] = [
				'name' => 'Педагогіка вищої школи',
				'description' => 'Навчальний курс з Педагогіки вищої школи для магістрів. Курс не є утвердженим для навчання та служить для наочного тестування правильності функціонування системи',
				'image' => 'pedagogics.jpg',
				'info' => 'Рекомендовано Міністерством освіти і науки України як навчальний посібник для студентів гірничих спеціальностей вищих навчальних закладів (лист Міністерства освіти і науки України від 12.11,2001 р. № І4/18.2-І633).
Подано характеристики вищої освіти, розглянуті питання управління навчально-методичною діяльністю вищого навчального закладу, проектування педагогічної системи, організації навчального процесу, технології підготовки фахівців з вищою освітою.
Матеріал навчального посібника спирається на праці визнаних фахівців з проблем вищої школи Володимира Петренка (Україна), Віктора Безпалька (Росія), Адольфа Мелецинека (Австрія). Посібник враховує положення Закону України "Про вищу освіту" та інших нормативних актів, висвітлює досвід НТУ у сфері планування та організації навчального процесу, впровадження новітніх технологій вищої школи.
Навчальний посібник призначений для магістрів, які вивчають освітні технології вищої школи. Може бути корисним викладачам, що працюють на первинних посадах вищих навчальних закладів.',
				'status' => 1,
				'alias' => 'pedagogics',
				'author_id' => 2,
			];
			
		for($i = 1; $i <= 8; $i++){
			$arr[] = [
				'name' => 'Курс '.$i,
				'description' => 'Опис курсу '.$i,
				'image' => 'course-'.$i.'.jpg',
				'info' => NULL,
				'status' => rand(1, 2),
				'alias' => 'course-'.$i,
				'author_id' => rand(2, 4),
			];
		}
    	
        DB::table('courses')->insert($arr);
        
    }
}
