<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PagesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
    	
//    	DB::table('pages')->truncate();

    	/*for($i = 1; $i <= 30; $i++){
			$arr[] = [
				'name' => 'Topic_name_'.$i,
				'content' => 'Content_example_'.$i,
				'number' => rand(1, 10),
				'topic_id' => rand(1, 10),
			];
		}*/
		
		$arr[] = [
				'name' => '1.1.Вища освіта',
				'content' => 'Вища освіта - це рівень освіти, який здобувається особою у вищому навчальному закладі в результаті послідовного, системного і цілеспрямованого процесу засвоєння змісту навчання, котрий ґрунтується на повній загальній середній освіті та завершується здобуттям певної кваліфікації за підсумками державної атестації.
В Україні підготовка фахівців з вищою освітою, які відповідатимуть потребам суспільства в сучасних умовах, забезпечується ступеневою системою освіти (рис. 1,1). У вищих навчальних закладах реалізується модель вищої професійної освіти, що націлена на підготовку особи до виконання професійної роботи на певних посадах (у відмінності від західної моделі, за якою вищі навчальні заклади реалізують професійно спрямовані освітні програми).
Основні завдання системи вищої освіти:
* забезпечення підготовки фахівців шляхом засвоєння освітньо-професійних програм, які задовольняють вимоги системи праці;
* відтворення, розвиток і передача новим поколінням досягнень науки, техніки та культури, підготовка їх до наступної діяльності, формування у молоді гуманістичних світоглядних принципів, необхідних для діяльності у демократичному суспільстві.
Освітні рівні вищої освіти (неповна вища освіта, базова вища освіта, повна вища освіта) - це характеристика вищої освіти за ознаками ступеня сформованості інтелектуальних якостей особи, достатніх для здобуття кваліфікації, яка відповідає певному освітньо-кваліфікаційному рівню.
Освітньо-кваліфікаційний рівень вищої освіти (молодший спеціаліст, бакалавр, спеціаліст, магістр) - характеристика вищої освіти за ознаками ступеня сформованості знань, умінь та навичок особи.',
				'number' => 1,
				'topic_id' => 1,
			];
		
		$arr[] = [
				'name' => '1.2. Вищий навчальний заклад',
				'content' => 'Вищий навчальний заклад (ВНЗ) - освітній, освітньо-науковий заклад, який заснований і діє відповідно до законодавства про освіту, реалізує відповідно до наданої ліцензії освітньо-професійні програми вищої освіти за певними освітніми та освітньо-кваліфікаційними рівнями, забезпечує навчання, виховання і професійну підготовку осіб відповідно до їх покликання, інтересів, здібностей та нормативних вимог у галузі вищої освіти, а також здійснює наукову і науково-технічну діяльність.
Вищий навчальний заклад державної форми власності - ВНЗ, заснований державою, що фінансується з державного бюджету І підпорядковується Міністерству освіти і науки України (МОН України) або галузевим міністерствам;
Вищий навчальний заклад, що перебуває у власності Автономної Республіки Крим, - ВНЗ, заснований органами влади Автономної Республіки Крим, що фінансується з бюджету Автономної Республіки Крим і підпорядкований органам влади Автономної Республіки Крим.
Вищий навчальний заклад комунальної форми власності - ВНЗ, заснований місцевими органами влади, що фінансується з місцевого бюджету і підпорядкований місцевим органам влади.
Вищий навчальний заклад приватної форми власності - ВНЗ, заснований на приватній власності і підпорядкований власнику (власникам).
Основна мета діяльності ВНЗ - забезпечення умов, необхідних для отримання особою вищої освіти, підготовка фахівців для потреб України.
Структурними підрозділами ВНЗ першого та другого рівнів акредитації є відділення і предметні (циклові) комісії.
Відділення - структурний підрозділ, що об`єднує навчальні групи з однієї або кількох спеціальностей, методичні, навчально-виробничі та інші підрозділи. Відділення створюється рішенням керівника ВНЗ, якщо на ньому навчається не менше ніж 150 студентів.
Предметна комісія - структурний навчально-методичний підрозділ, що проводить виховну, навчальну та методичну роботу з однієї або кількох споріднених навчальних дисциплін. Предметна (циклова) комісія створюється рішенням керівника ВНЗ за умови, якщо до ЇЇ складу входить не менше ніж три педагогічних працівники.
Філія - відокремлений структурний підрозділ, що створюється з метою забезпечення потреб у фахівцях місцевого ринку праці та наближення місця навчання студентів до їх місця проживання
',
				'number' => 2,
				'topic_id' => 1,
			];
		
		$arr[] = [
				'name' => '1.3. Концепція освітньої діяльності вищого навчального закладу',
				'content' => 'Концепція освітньої діяльності ВНЗ є складовою його статуту, який затверджує МОН України. Як приклад нижче подана концепція освітньої діяльності Національного гірничого університету.
Ціпі, принципи та цільові програми освітньої діяльності Національного гірничого університету (далі Університет) еідловідають концептуальним ідеям національної Доктрини розвитку освіти, Закону України "Про освіту", Закону України "Про вищу освіту", Державної національної програми "Освіта" ("Україна XXI століття").
Цілі освітньої діяльності:	, .
*	відтворення Інтелектуального потенціалу держави;
*	забезпечення сфер соціальної та виробничої діяльності кваліфікованими фахівцями;»  формування моральних принципів та норм поводження особистості.
Освітня діяльність базується на принципах:
*	багатопрофільності;
*	якості освітніх послуг: якості змісту освіти, якості результатів освіти, якості технологійнавчання;
*	ступеневості підготовки фахівців;
*	становлення демократичної системи навчання;
*	задоволення освітніх потреб студентів відповідно до їх інтересів, здібностей та потребсуспільства;
.   *  використання державних стандартів вищої освіти як обов`язкового мінімуму змісту освіти і змісту навчання;
/9
*	відповідності рівня освіти та освітньо-кваліфікаційного рівня підготовки випускників вимогамсуспільного поділу праці;
*	випереджального інноваційного розвитку освіти;
*	мобільності підготовки фахівців щодо задоволення вимог ринку праці;»  особистісної орієнтації освіти;
»  інтеграції до європейського та світового освітніх просторів;
*	формування національних і загальнолюдських цінностей;
*	системності аналізу всіх чинників, що впливають на якість освітньої діяльності, моніторингу тасвоєчасного запобігання кризових явищ на рівні академічної групи, навчального курсу, кафедри,факультету, навчального закладу;
*	моніторингу якості освіти, забезпечення його прозорості, сприяння розвитку громадськогоконтролю.
Цільові програми діяльності та засоби реалізації
Кадрове забезпечення основних галузей промисловості та сфери послуг через:
*	формування якісного контингенту студентів;
« адекватність змісту освіти вимогам системи праці;
*	формування змісту освіти та змісту навчання на основі суб`сктно-діяльнісного підходу запринципами цілеспрямованості, прогностичності та діагностичності;
» формування вузівської компоненти державних стандартів вищої освіти з урахуванням традицій наукових шкіл Університету, потреб галузі та запитів студентів;
*	формування номенклатури напрямів і спеціальностей адекватно змінам ринкових умов;
*	конкурентоспроможність випускників на ринку праці;
*	оновлення змісту освіти та організації навчально-виховного процесу відповідно додемократичних цінностей, сучасних науково-технічних досягнень;
',
				'number' => 3,
				'topic_id' => 1,
			];
		
		$arr[] = [
				'name' => '1.4. Ліцензування освітньої діяльності, акредитація напрямів, спеціальностей та вищих навчальних закладів',
				'content' => 'Освітня діяльність на території України здійснюється вищими навчальними закладами на підставі ліцензій, які видаються у порядку, встановленому Кабінетом Міністрів України.
Ліцензування освітньої діяльності ВНЗ здійснюється перед початком підготовки фахівців за напрямом, спеціальністю.
Ліцензування - процедура визнання спроможності ВНЗ певного типу розпочати освітню діяльність, пов`язану із здобуттям вищої освіти та кваліфікації, відповідно до вимог стандартів вищої освіти, а також до державних вимог щодо кадрового, науково-методичного та матеріально-технічного забезпечення.
Міністерство освіти і науки України на підставі заяви ВНЗ про проведення ліцензійної експертизи у двомісячний термін приймає рішення про видачу ліцензії або про відмову у ЇЇ видачі.
Обов`язковою умовою видачі ліцензії вищим навчальним закладам є наявність у них необхідної матеріально-технічної, науково-методичної та інформаційної бази, бібліотеки, науково-педагогічних кадрів за нормативами, що встановлює МОН України.
Вищому навчальному закладу, що успішно пройшов ліцензійну експертизу, видається ліцензія на освітню діяльність, як правило, на термін завершення циклу підготовки фахівців за напрямом, спеціальністю, але не менше ніж на три роки. Продовження терміну дії ліцензії здійснюється у порядку, встановленому для її одержання. Із дня прийняття рішення про ліквідацію ВНЗ видана ліцензія втрачає чинність.
оищі навчальні заклади, що мають ліцензії, вносяться МОН ^країни до Державного реєстру вищих навчальних закладів.
Наприкінці терміну дії ліцензії через процедуру акредитації визначається відповідність рівня підготовки фахівців за ліцензованими спеціальностями.
Акредитація   -   процедура  надання  вищому  навчальному  закладу
вного типу права проводити освітню діяльність, пов`язану із здобуттям
Щоі освіти та кваліфікації, відповідно до вимог стандартів вищої освіти,
акож до державних вимог щодо кадрового,  науково-методичного та
матеріально-технічного забезпечення.
',
				'number' => 4,
				'topic_id' => 1,
			];
		
		$arr[] = [
				'name' => '1.5. Суб`єкти навчально-виховного процесу',
				'content' => 'Особами, які навчаються у вищих навчальних закладах, є студенти (слухачі), курсанти, екстерни, асистенти-стажисти, інтерни, клінічні ординатори, здобувачі, аспіранти (ад`юнкти) та докторанти.
Студент (слухач) - особа, яка в установленому порядку зарахована до ВНЗ і навчається за денною (очною), вечірньою або заочного, дистанційною формами навчання з метою здобуття певних освітнього та освітньо-кваліфікаційного рівнів.
Курсант - особа, яка в установленому порядку зарахована до військового ВНЗ і навчається з метою здобуття певних освітнього та освітньо-кваліфікаційного рівнів.
екстерн   -   особа,   яка   в   установленому   порядку   зарахована   до
ВНЧ має    відповідний    освітній,    освітньо-кваліфікаційний    рівень    і
вчається за екстернатною формою навчання з метою здобуття певних Ітнього та освітньо-кваліфікаційного рівнів. Асистент-стажист - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень магістра або спеціаліста, навчається в асистентурі (стажування) ВНЗ мистецького профілю з метою удосконалення творчої майстерності.
Інтерн - особа, яка має повну вищу освіту і освітньо-кваліфікаційний рівень спеціаліста медичного або фармацевтичного спрямування, навчається з метою отримання кваліфікації лікаря або провізора певної спеціальності відповідно до переліку лікарських або провізорських посад.
Клінічний ординатор - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень спеціаліста або магістра медичного спрямування та кваліфікацію лікаря певної спеціальності відповідно до переліку лікарських посад, навчається з метою поглиблення професійних знань, підвищення рівнів умінь та навичок лікаря-спеціаліста.
Здобувач - особа, яка прикріплена до аспірантури або докторантури ВНЗ або наукової установи і готує дисертацію на здобуття наукового ступеня кандидата наук без навчання в аспірантурі, або особа, яка має науковий ступінь кандидата наук і готує дисертацію на здобуття наукового ступеня доктора наук без перебування в докторантурі.
Аспірант (ад`юнкт) - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень магістра або спеціаліста, навчається в аспірантурі (ад`юнктурі) ВНЗ або наукової установи для підготовки дисертації на здобуття наукового ступеня кандидата наук.
Докторант - особа, яка має науковий ступінь кандидата наук і зарахована до докторантури для підготовки дисертації на здобуття наукового ступеня доктора наук.

',
				'number' => 5,
				'topic_id' => 1,
			];
		
		$arr[] = [
				'name' => '2.1.Вища освіта',
				'content' => 'Вища освіта - це рівень освіти, який здобувається особою у вищому навчальному закладі в результаті послідовного, системного і цілеспрямованого процесу засвоєння змісту навчання, котрий ґрунтується на повній загальній середній освіті та завершується здобуттям певної кваліфікації за підсумками державної атестації.
В Україні підготовка фахівців з вищою освітою, які відповідатимуть потребам суспільства в сучасних умовах, забезпечується ступеневою системою освіти (рис. 1,1). У вищих навчальних закладах реалізується модель вищої професійної освіти, що націлена на підготовку особи до виконання професійної роботи на певних посадах (у відмінності від західної моделі, за якою вищі навчальні заклади реалізують професійно спрямовані освітні програми).
Основні завдання системи вищої освіти:
* забезпечення підготовки фахівців шляхом засвоєння освітньо-професійних програм, які задовольняють вимоги системи праці;
* відтворення, розвиток і передача новим поколінням досягнень науки, техніки та культури, підготовка їх до наступної діяльності, формування у молоді гуманістичних світоглядних принципів, необхідних для діяльності у демократичному суспільстві.
Освітні рівні вищої освіти (неповна вища освіта, базова вища освіта, повна вища освіта) - це характеристика вищої освіти за ознаками ступеня сформованості інтелектуальних якостей особи, достатніх для здобуття кваліфікації, яка відповідає певному освітньо-кваліфікаційному рівню.
Освітньо-кваліфікаційний рівень вищої освіти (молодший спеціаліст, бакалавр, спеціаліст, магістр) - характеристика вищої освіти за ознаками ступеня сформованості знань, умінь та навичок особи.',
				'number' => 1,
				'topic_id' => 2,
			];
		
		$arr[] = [
				'name' => '2.2. Вищий навчальний заклад',
				'content' => 'Вищий навчальний заклад (ВНЗ) - освітній, освітньо-науковий заклад, який заснований і діє відповідно до законодавства про освіту, реалізує відповідно до наданої ліцензії освітньо-професійні програми вищої освіти за певними освітніми та освітньо-кваліфікаційними рівнями, забезпечує навчання, виховання і професійну підготовку осіб відповідно до їх покликання, інтересів, здібностей та нормативних вимог у галузі вищої освіти, а також здійснює наукову і науково-технічну діяльність.
Вищий навчальний заклад державної форми власності - ВНЗ, заснований державою, що фінансується з державного бюджету І підпорядковується Міністерству освіти і науки України (МОН України) або галузевим міністерствам;
Вищий навчальний заклад, що перебуває у власності Автономної Республіки Крим, - ВНЗ, заснований органами влади Автономної Республіки Крим, що фінансується з бюджету Автономної Республіки Крим і підпорядкований органам влади Автономної Республіки Крим.
Вищий навчальний заклад комунальної форми власності - ВНЗ, заснований місцевими органами влади, що фінансується з місцевого бюджету і підпорядкований місцевим органам влади.
Вищий навчальний заклад приватної форми власності - ВНЗ, заснований на приватній власності і підпорядкований власнику (власникам).
Основна мета діяльності ВНЗ - забезпечення умов, необхідних для отримання особою вищої освіти, підготовка фахівців для потреб України.
Структурними підрозділами ВНЗ першого та другого рівнів акредитації є відділення і предметні (циклові) комісії.
Відділення - структурний підрозділ, що об`єднує навчальні групи з однієї або кількох спеціальностей, методичні, навчально-виробничі та інші підрозділи. Відділення створюється рішенням керівника ВНЗ, якщо на ньому навчається не менше ніж 150 студентів.
Предметна комісія - структурний навчально-методичний підрозділ, що проводить виховну, навчальну та методичну роботу з однієї або кількох споріднених навчальних дисциплін. Предметна (циклова) комісія створюється рішенням керівника ВНЗ за умови, якщо до ЇЇ складу входить не менше ніж три педагогічних працівники.
Філія - відокремлений структурний підрозділ, що створюється з метою забезпечення потреб у фахівцях місцевого ринку праці та наближення місця навчання студентів до їх місця проживання
',
				'number' => 2,
				'topic_id' => 2,
			];
		
		$arr[] = [
				'name' => '2.3. Концепція освітньої діяльності вищого навчального закладу',
				'content' => 'Концепція освітньої діяльності ВНЗ є складовою його статуту, який затверджує МОН України. Як приклад нижче подана концепція освітньої діяльності Національного гірничого університету.
Ціпі, принципи та цільові програми освітньої діяльності Національного гірничого університету (далі Університет) еідловідають концептуальним ідеям національної Доктрини розвитку освіти, Закону України "Про освіту", Закону України "Про вищу освіту", Державної національної програми "Освіта" ("Україна XXI століття").
Цілі освітньої діяльності:	, .
*	відтворення Інтелектуального потенціалу держави;
*	забезпечення сфер соціальної та виробничої діяльності кваліфікованими фахівцями;»  формування моральних принципів та норм поводження особистості.
Освітня діяльність базується на принципах:
*	багатопрофільності;
*	якості освітніх послуг: якості змісту освіти, якості результатів освіти, якості технологійнавчання;
*	ступеневості підготовки фахівців;
*	становлення демократичної системи навчання;
*	задоволення освітніх потреб студентів відповідно до їх інтересів, здібностей та потребсуспільства;
.   *  використання державних стандартів вищої освіти як обов`язкового мінімуму змісту освіти і змісту навчання;
/9
*	відповідності рівня освіти та освітньо-кваліфікаційного рівня підготовки випускників вимогамсуспільного поділу праці;
*	випереджального інноваційного розвитку освіти;
*	мобільності підготовки фахівців щодо задоволення вимог ринку праці;»  особистісної орієнтації освіти;
»  інтеграції до європейського та світового освітніх просторів;
*	формування національних і загальнолюдських цінностей;
*	системності аналізу всіх чинників, що впливають на якість освітньої діяльності, моніторингу тасвоєчасного запобігання кризових явищ на рівні академічної групи, навчального курсу, кафедри,факультету, навчального закладу;
*	моніторингу якості освіти, забезпечення його прозорості, сприяння розвитку громадськогоконтролю.
Цільові програми діяльності та засоби реалізації
Кадрове забезпечення основних галузей промисловості та сфери послуг через:
*	формування якісного контингенту студентів;
« адекватність змісту освіти вимогам системи праці;
*	формування змісту освіти та змісту навчання на основі суб`сктно-діяльнісного підходу запринципами цілеспрямованості, прогностичності та діагностичності;
» формування вузівської компоненти державних стандартів вищої освіти з урахуванням традицій наукових шкіл Університету, потреб галузі та запитів студентів;
*	формування номенклатури напрямів і спеціальностей адекватно змінам ринкових умов;
*	конкурентоспроможність випускників на ринку праці;
*	оновлення змісту освіти та організації навчально-виховного процесу відповідно додемократичних цінностей, сучасних науково-технічних досягнень;
',
				'number' => 3,
				'topic_id' => 2,
			];
		
		$arr[] = [
				'name' => '2.4. Ліцензування освітньої діяльності, акредитація напрямів, спеціальностей та вищих навчальних закладів',
				'content' => 'Освітня діяльність на території України здійснюється вищими навчальними закладами на підставі ліцензій, які видаються у порядку, встановленому Кабінетом Міністрів України.
Ліцензування освітньої діяльності ВНЗ здійснюється перед початком підготовки фахівців за напрямом, спеціальністю.
Ліцензування - процедура визнання спроможності ВНЗ певного типу розпочати освітню діяльність, пов`язану із здобуттям вищої освіти та кваліфікації, відповідно до вимог стандартів вищої освіти, а також до державних вимог щодо кадрового, науково-методичного та матеріально-технічного забезпечення.
Міністерство освіти і науки України на підставі заяви ВНЗ про проведення ліцензійної експертизи у двомісячний термін приймає рішення про видачу ліцензії або про відмову у ЇЇ видачі.
Обов`язковою умовою видачі ліцензії вищим навчальним закладам є наявність у них необхідної матеріально-технічної, науково-методичної та інформаційної бази, бібліотеки, науково-педагогічних кадрів за нормативами, що встановлює МОН України.
Вищому навчальному закладу, що успішно пройшов ліцензійну експертизу, видається ліцензія на освітню діяльність, як правило, на термін завершення циклу підготовки фахівців за напрямом, спеціальністю, але не менше ніж на три роки. Продовження терміну дії ліцензії здійснюється у порядку, встановленому для її одержання. Із дня прийняття рішення про ліквідацію ВНЗ видана ліцензія втрачає чинність.
оищі навчальні заклади, що мають ліцензії, вносяться МОН ^країни до Державного реєстру вищих навчальних закладів.
Наприкінці терміну дії ліцензії через процедуру акредитації визначається відповідність рівня підготовки фахівців за ліцензованими спеціальностями.
Акредитація   -   процедура  надання  вищому  навчальному  закладу
вного типу права проводити освітню діяльність, пов`язану із здобуттям
Щоі освіти та кваліфікації, відповідно до вимог стандартів вищої освіти,
акож до державних вимог щодо кадрового,  науково-методичного та
матеріально-технічного забезпечення.
',
				'number' => 4,
				'topic_id' => 2,
			];
		
		$arr[] = [
				'name' => '2.5. Суб`єкти навчально-виховного процесу',
				'content' => 'Особами, які навчаються у вищих навчальних закладах, є студенти (слухачі), курсанти, екстерни, асистенти-стажисти, інтерни, клінічні ординатори, здобувачі, аспіранти (ад`юнкти) та докторанти.
Студент (слухач) - особа, яка в установленому порядку зарахована до ВНЗ і навчається за денною (очною), вечірньою або заочного, дистанційною формами навчання з метою здобуття певних освітнього та освітньо-кваліфікаційного рівнів.
Курсант - особа, яка в установленому порядку зарахована до військового ВНЗ і навчається з метою здобуття певних освітнього та освітньо-кваліфікаційного рівнів.
екстерн   -   особа,   яка   в   установленому   порядку   зарахована   до
ВНЧ має    відповідний    освітній,    освітньо-кваліфікаційний    рівень    і
вчається за екстернатною формою навчання з метою здобуття певних Ітнього та освітньо-кваліфікаційного рівнів. Асистент-стажист - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень магістра або спеціаліста, навчається в асистентурі (стажування) ВНЗ мистецького профілю з метою удосконалення творчої майстерності.
Інтерн - особа, яка має повну вищу освіту і освітньо-кваліфікаційний рівень спеціаліста медичного або фармацевтичного спрямування, навчається з метою отримання кваліфікації лікаря або провізора певної спеціальності відповідно до переліку лікарських або провізорських посад.
Клінічний ординатор - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень спеціаліста або магістра медичного спрямування та кваліфікацію лікаря певної спеціальності відповідно до переліку лікарських посад, навчається з метою поглиблення професійних знань, підвищення рівнів умінь та навичок лікаря-спеціаліста.
Здобувач - особа, яка прикріплена до аспірантури або докторантури ВНЗ або наукової установи і готує дисертацію на здобуття наукового ступеня кандидата наук без навчання в аспірантурі, або особа, яка має науковий ступінь кандидата наук і готує дисертацію на здобуття наукового ступеня доктора наук без перебування в докторантурі.
Аспірант (ад`юнкт) - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень магістра або спеціаліста, навчається в аспірантурі (ад`юнктурі) ВНЗ або наукової установи для підготовки дисертації на здобуття наукового ступеня кандидата наук.
Докторант - особа, яка має науковий ступінь кандидата наук і зарахована до докторантури для підготовки дисертації на здобуття наукового ступеня доктора наук.

',
				'number' => 5,
				'topic_id' => 2,
			];
			
		$arr[] = [
				'name' => '3.1.Вища освіта',
				'content' => 'Вища освіта - це рівень освіти, який здобувається особою у вищому навчальному закладі в результаті послідовного, системного і цілеспрямованого процесу засвоєння змісту навчання, котрий ґрунтується на повній загальній середній освіті та завершується здобуттям певної кваліфікації за підсумками державної атестації.
В Україні підготовка фахівців з вищою освітою, які відповідатимуть потребам суспільства в сучасних умовах, забезпечується ступеневою системою освіти (рис. 1,1). У вищих навчальних закладах реалізується модель вищої професійної освіти, що націлена на підготовку особи до виконання професійної роботи на певних посадах (у відмінності від західної моделі, за якою вищі навчальні заклади реалізують професійно спрямовані освітні програми).
Основні завдання системи вищої освіти:
* забезпечення підготовки фахівців шляхом засвоєння освітньо-професійних програм, які задовольняють вимоги системи праці;
* відтворення, розвиток і передача новим поколінням досягнень науки, техніки та культури, підготовка їх до наступної діяльності, формування у молоді гуманістичних світоглядних принципів, необхідних для діяльності у демократичному суспільстві.
Освітні рівні вищої освіти (неповна вища освіта, базова вища освіта, повна вища освіта) - це характеристика вищої освіти за ознаками ступеня сформованості інтелектуальних якостей особи, достатніх для здобуття кваліфікації, яка відповідає певному освітньо-кваліфікаційному рівню.
Освітньо-кваліфікаційний рівень вищої освіти (молодший спеціаліст, бакалавр, спеціаліст, магістр) - характеристика вищої освіти за ознаками ступеня сформованості знань, умінь та навичок особи.',
				'number' => 1,
				'topic_id' => 3,
			];
		
		$arr[] = [
				'name' => '3.2. Вищий навчальний заклад',
				'content' => 'Вищий навчальний заклад (ВНЗ) - освітній, освітньо-науковий заклад, який заснований і діє відповідно до законодавства про освіту, реалізує відповідно до наданої ліцензії освітньо-професійні програми вищої освіти за певними освітніми та освітньо-кваліфікаційними рівнями, забезпечує навчання, виховання і професійну підготовку осіб відповідно до їх покликання, інтересів, здібностей та нормативних вимог у галузі вищої освіти, а також здійснює наукову і науково-технічну діяльність.
Вищий навчальний заклад державної форми власності - ВНЗ, заснований державою, що фінансується з державного бюджету І підпорядковується Міністерству освіти і науки України (МОН України) або галузевим міністерствам;
Вищий навчальний заклад, що перебуває у власності Автономної Республіки Крим, - ВНЗ, заснований органами влади Автономної Республіки Крим, що фінансується з бюджету Автономної Республіки Крим і підпорядкований органам влади Автономної Республіки Крим.
Вищий навчальний заклад комунальної форми власності - ВНЗ, заснований місцевими органами влади, що фінансується з місцевого бюджету і підпорядкований місцевим органам влади.
Вищий навчальний заклад приватної форми власності - ВНЗ, заснований на приватній власності і підпорядкований власнику (власникам).
Основна мета діяльності ВНЗ - забезпечення умов, необхідних для отримання особою вищої освіти, підготовка фахівців для потреб України.
Структурними підрозділами ВНЗ першого та другого рівнів акредитації є відділення і предметні (циклові) комісії.
Відділення - структурний підрозділ, що об`єднує навчальні групи з однієї або кількох спеціальностей, методичні, навчально-виробничі та інші підрозділи. Відділення створюється рішенням керівника ВНЗ, якщо на ньому навчається не менше ніж 150 студентів.
Предметна комісія - структурний навчально-методичний підрозділ, що проводить виховну, навчальну та методичну роботу з однієї або кількох споріднених навчальних дисциплін. Предметна (циклова) комісія створюється рішенням керівника ВНЗ за умови, якщо до ЇЇ складу входить не менше ніж три педагогічних працівники.
Філія - відокремлений структурний підрозділ, що створюється з метою забезпечення потреб у фахівцях місцевого ринку праці та наближення місця навчання студентів до їх місця проживання
',
				'number' => 2,
				'topic_id' => 3,
			];
		
		$arr[] = [
				'name' => '3.3. Концепція освітньої діяльності вищого навчального закладу',
				'content' => 'Концепція освітньої діяльності ВНЗ є складовою його статуту, який затверджує МОН України. Як приклад нижче подана концепція освітньої діяльності Національного гірничого університету.
Ціпі, принципи та цільові програми освітньої діяльності Національного гірничого університету (далі Університет) еідловідають концептуальним ідеям національної Доктрини розвитку освіти, Закону України "Про освіту", Закону України "Про вищу освіту", Державної національної програми "Освіта" ("Україна XXI століття").
Цілі освітньої діяльності:	, .
*	відтворення Інтелектуального потенціалу держави;
*	забезпечення сфер соціальної та виробничої діяльності кваліфікованими фахівцями;»  формування моральних принципів та норм поводження особистості.
Освітня діяльність базується на принципах:
*	багатопрофільності;
*	якості освітніх послуг: якості змісту освіти, якості результатів освіти, якості технологійнавчання;
*	ступеневості підготовки фахівців;
*	становлення демократичної системи навчання;
*	задоволення освітніх потреб студентів відповідно до їх інтересів, здібностей та потребсуспільства;
.   *  використання державних стандартів вищої освіти як обов`язкового мінімуму змісту освіти і змісту навчання;
/9
*	відповідності рівня освіти та освітньо-кваліфікаційного рівня підготовки випускників вимогамсуспільного поділу праці;
*	випереджального інноваційного розвитку освіти;
*	мобільності підготовки фахівців щодо задоволення вимог ринку праці;»  особистісної орієнтації освіти;
»  інтеграції до європейського та світового освітніх просторів;
*	формування національних і загальнолюдських цінностей;
*	системності аналізу всіх чинників, що впливають на якість освітньої діяльності, моніторингу тасвоєчасного запобігання кризових явищ на рівні академічної групи, навчального курсу, кафедри,факультету, навчального закладу;
*	моніторингу якості освіти, забезпечення його прозорості, сприяння розвитку громадськогоконтролю.
Цільові програми діяльності та засоби реалізації
Кадрове забезпечення основних галузей промисловості та сфери послуг через:
*	формування якісного контингенту студентів;
« адекватність змісту освіти вимогам системи праці;
*	формування змісту освіти та змісту навчання на основі суб`сктно-діяльнісного підходу запринципами цілеспрямованості, прогностичності та діагностичності;
» формування вузівської компоненти державних стандартів вищої освіти з урахуванням традицій наукових шкіл Університету, потреб галузі та запитів студентів;
*	формування номенклатури напрямів і спеціальностей адекватно змінам ринкових умов;
*	конкурентоспроможність випускників на ринку праці;
*	оновлення змісту освіти та організації навчально-виховного процесу відповідно додемократичних цінностей, сучасних науково-технічних досягнень;
',
				'number' => 3,
				'topic_id' => 3,
			];
		
		$arr[] = [
				'name' => '3.4. Ліцензування освітньої діяльності, акредитація напрямів, спеціальностей та вищих навчальних закладів',
				'content' => 'Освітня діяльність на території України здійснюється вищими навчальними закладами на підставі ліцензій, які видаються у порядку, встановленому Кабінетом Міністрів України.
Ліцензування освітньої діяльності ВНЗ здійснюється перед початком підготовки фахівців за напрямом, спеціальністю.
Ліцензування - процедура визнання спроможності ВНЗ певного типу розпочати освітню діяльність, пов`язану із здобуттям вищої освіти та кваліфікації, відповідно до вимог стандартів вищої освіти, а також до державних вимог щодо кадрового, науково-методичного та матеріально-технічного забезпечення.
Міністерство освіти і науки України на підставі заяви ВНЗ про проведення ліцензійної експертизи у двомісячний термін приймає рішення про видачу ліцензії або про відмову у ЇЇ видачі.
Обов`язковою умовою видачі ліцензії вищим навчальним закладам є наявність у них необхідної матеріально-технічної, науково-методичної та інформаційної бази, бібліотеки, науково-педагогічних кадрів за нормативами, що встановлює МОН України.
Вищому навчальному закладу, що успішно пройшов ліцензійну експертизу, видається ліцензія на освітню діяльність, як правило, на термін завершення циклу підготовки фахівців за напрямом, спеціальністю, але не менше ніж на три роки. Продовження терміну дії ліцензії здійснюється у порядку, встановленому для її одержання. Із дня прийняття рішення про ліквідацію ВНЗ видана ліцензія втрачає чинність.
оищі навчальні заклади, що мають ліцензії, вносяться МОН ^країни до Державного реєстру вищих навчальних закладів.
Наприкінці терміну дії ліцензії через процедуру акредитації визначається відповідність рівня підготовки фахівців за ліцензованими спеціальностями.
Акредитація   -   процедура  надання  вищому  навчальному  закладу
вного типу права проводити освітню діяльність, пов`язану із здобуттям
Щоі освіти та кваліфікації, відповідно до вимог стандартів вищої освіти,
акож до державних вимог щодо кадрового,  науково-методичного та
матеріально-технічного забезпечення.
',
				'number' => 4,
				'topic_id' => 3,
			];
		
		$arr[] = [
				'name' => '3.5. Суб`єкти навчально-виховного процесу',
				'content' => 'Особами, які навчаються у вищих навчальних закладах, є студенти (слухачі), курсанти, екстерни, асистенти-стажисти, інтерни, клінічні ординатори, здобувачі, аспіранти (ад`юнкти) та докторанти.
Студент (слухач) - особа, яка в установленому порядку зарахована до ВНЗ і навчається за денною (очною), вечірньою або заочного, дистанційною формами навчання з метою здобуття певних освітнього та освітньо-кваліфікаційного рівнів.
Курсант - особа, яка в установленому порядку зарахована до військового ВНЗ і навчається з метою здобуття певних освітнього та освітньо-кваліфікаційного рівнів.
екстерн   -   особа,   яка   в   установленому   порядку   зарахована   до
ВНЧ має    відповідний    освітній,    освітньо-кваліфікаційний    рівень    і
вчається за екстернатною формою навчання з метою здобуття певних Ітнього та освітньо-кваліфікаційного рівнів. Асистент-стажист - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень магістра або спеціаліста, навчається в асистентурі (стажування) ВНЗ мистецького профілю з метою удосконалення творчої майстерності.
Інтерн - особа, яка має повну вищу освіту і освітньо-кваліфікаційний рівень спеціаліста медичного або фармацевтичного спрямування, навчається з метою отримання кваліфікації лікаря або провізора певної спеціальності відповідно до переліку лікарських або провізорських посад.
Клінічний ординатор - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень спеціаліста або магістра медичного спрямування та кваліфікацію лікаря певної спеціальності відповідно до переліку лікарських посад, навчається з метою поглиблення професійних знань, підвищення рівнів умінь та навичок лікаря-спеціаліста.
Здобувач - особа, яка прикріплена до аспірантури або докторантури ВНЗ або наукової установи і готує дисертацію на здобуття наукового ступеня кандидата наук без навчання в аспірантурі, або особа, яка має науковий ступінь кандидата наук і готує дисертацію на здобуття наукового ступеня доктора наук без перебування в докторантурі.
Аспірант (ад`юнкт) - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень магістра або спеціаліста, навчається в аспірантурі (ад`юнктурі) ВНЗ або наукової установи для підготовки дисертації на здобуття наукового ступеня кандидата наук.
Докторант - особа, яка має науковий ступінь кандидата наук і зарахована до докторантури для підготовки дисертації на здобуття наукового ступеня доктора наук.

',
				'number' => 5,
				'topic_id' => 3,
			];
			
		$arr[] = [
				'name' => '4.1.Вища освіта',
				'content' => 'Вища освіта - це рівень освіти, який здобувається особою у вищому навчальному закладі в результаті послідовного, системного і цілеспрямованого процесу засвоєння змісту навчання, котрий ґрунтується на повній загальній середній освіті та завершується здобуттям певної кваліфікації за підсумками державної атестації.
В Україні підготовка фахівців з вищою освітою, які відповідатимуть потребам суспільства в сучасних умовах, забезпечується ступеневою системою освіти (рис. 1,1). У вищих навчальних закладах реалізується модель вищої професійної освіти, що націлена на підготовку особи до виконання професійної роботи на певних посадах (у відмінності від західної моделі, за якою вищі навчальні заклади реалізують професійно спрямовані освітні програми).
Основні завдання системи вищої освіти:
* забезпечення підготовки фахівців шляхом засвоєння освітньо-професійних програм, які задовольняють вимоги системи праці;
* відтворення, розвиток і передача новим поколінням досягнень науки, техніки та культури, підготовка їх до наступної діяльності, формування у молоді гуманістичних світоглядних принципів, необхідних для діяльності у демократичному суспільстві.
Освітні рівні вищої освіти (неповна вища освіта, базова вища освіта, повна вища освіта) - це характеристика вищої освіти за ознаками ступеня сформованості інтелектуальних якостей особи, достатніх для здобуття кваліфікації, яка відповідає певному освітньо-кваліфікаційному рівню.
Освітньо-кваліфікаційний рівень вищої освіти (молодший спеціаліст, бакалавр, спеціаліст, магістр) - характеристика вищої освіти за ознаками ступеня сформованості знань, умінь та навичок особи.',
				'number' => 1,
				'topic_id' => 4,
			];
		
		$arr[] = [
				'name' => '4.2. Вищий навчальний заклад',
				'content' => 'Вищий навчальний заклад (ВНЗ) - освітній, освітньо-науковий заклад, який заснований і діє відповідно до законодавства про освіту, реалізує відповідно до наданої ліцензії освітньо-професійні програми вищої освіти за певними освітніми та освітньо-кваліфікаційними рівнями, забезпечує навчання, виховання і професійну підготовку осіб відповідно до їх покликання, інтересів, здібностей та нормативних вимог у галузі вищої освіти, а також здійснює наукову і науково-технічну діяльність.
Вищий навчальний заклад державної форми власності - ВНЗ, заснований державою, що фінансується з державного бюджету І підпорядковується Міністерству освіти і науки України (МОН України) або галузевим міністерствам;
Вищий навчальний заклад, що перебуває у власності Автономної Республіки Крим, - ВНЗ, заснований органами влади Автономної Республіки Крим, що фінансується з бюджету Автономної Республіки Крим і підпорядкований органам влади Автономної Республіки Крим.
Вищий навчальний заклад комунальної форми власності - ВНЗ, заснований місцевими органами влади, що фінансується з місцевого бюджету і підпорядкований місцевим органам влади.
Вищий навчальний заклад приватної форми власності - ВНЗ, заснований на приватній власності і підпорядкований власнику (власникам).
Основна мета діяльності ВНЗ - забезпечення умов, необхідних для отримання особою вищої освіти, підготовка фахівців для потреб України.
Структурними підрозділами ВНЗ першого та другого рівнів акредитації є відділення і предметні (циклові) комісії.
Відділення - структурний підрозділ, що об`єднує навчальні групи з однієї або кількох спеціальностей, методичні, навчально-виробничі та інші підрозділи. Відділення створюється рішенням керівника ВНЗ, якщо на ньому навчається не менше ніж 150 студентів.
Предметна комісія - структурний навчально-методичний підрозділ, що проводить виховну, навчальну та методичну роботу з однієї або кількох споріднених навчальних дисциплін. Предметна (циклова) комісія створюється рішенням керівника ВНЗ за умови, якщо до ЇЇ складу входить не менше ніж три педагогічних працівники.
Філія - відокремлений структурний підрозділ, що створюється з метою забезпечення потреб у фахівцях місцевого ринку праці та наближення місця навчання студентів до їх місця проживання
',
				'number' => 2,
				'topic_id' => 4,
			];
		
		$arr[] = [
				'name' => '4.3. Концепція освітньої діяльності вищого навчального закладу',
				'content' => 'Концепція освітньої діяльності ВНЗ є складовою його статуту, який затверджує МОН України. Як приклад нижче подана концепція освітньої діяльності Національного гірничого університету.
Ціпі, принципи та цільові програми освітньої діяльності Національного гірничого університету (далі Університет) еідловідають концептуальним ідеям національної Доктрини розвитку освіти, Закону України "Про освіту", Закону України "Про вищу освіту", Державної національної програми "Освіта" ("Україна XXI століття").
Цілі освітньої діяльності:	, .
*	відтворення Інтелектуального потенціалу держави;
*	забезпечення сфер соціальної та виробничої діяльності кваліфікованими фахівцями;»  формування моральних принципів та норм поводження особистості.
Освітня діяльність базується на принципах:
*	багатопрофільності;
*	якості освітніх послуг: якості змісту освіти, якості результатів освіти, якості технологійнавчання;
*	ступеневості підготовки фахівців;
*	становлення демократичної системи навчання;
*	задоволення освітніх потреб студентів відповідно до їх інтересів, здібностей та потребсуспільства;
.   *  використання державних стандартів вищої освіти як обов`язкового мінімуму змісту освіти і змісту навчання;
/9
*	відповідності рівня освіти та освітньо-кваліфікаційного рівня підготовки випускників вимогамсуспільного поділу праці;
*	випереджального інноваційного розвитку освіти;
*	мобільності підготовки фахівців щодо задоволення вимог ринку праці;»  особистісної орієнтації освіти;
»  інтеграції до європейського та світового освітніх просторів;
*	формування національних і загальнолюдських цінностей;
*	системності аналізу всіх чинників, що впливають на якість освітньої діяльності, моніторингу тасвоєчасного запобігання кризових явищ на рівні академічної групи, навчального курсу, кафедри,факультету, навчального закладу;
*	моніторингу якості освіти, забезпечення його прозорості, сприяння розвитку громадськогоконтролю.
Цільові програми діяльності та засоби реалізації
Кадрове забезпечення основних галузей промисловості та сфери послуг через:
*	формування якісного контингенту студентів;
« адекватність змісту освіти вимогам системи праці;
*	формування змісту освіти та змісту навчання на основі суб`сктно-діяльнісного підходу запринципами цілеспрямованості, прогностичності та діагностичності;
» формування вузівської компоненти державних стандартів вищої освіти з урахуванням традицій наукових шкіл Університету, потреб галузі та запитів студентів;
*	формування номенклатури напрямів і спеціальностей адекватно змінам ринкових умов;
*	конкурентоспроможність випускників на ринку праці;
*	оновлення змісту освіти та організації навчально-виховного процесу відповідно додемократичних цінностей, сучасних науково-технічних досягнень;
',
				'number' => 3,
				'topic_id' => 4,
			];
		
		$arr[] = [
				'name' => '4.4. Ліцензування освітньої діяльності, акредитація напрямів, спеціальностей та вищих навчальних закладів',
				'content' => 'Освітня діяльність на території України здійснюється вищими навчальними закладами на підставі ліцензій, які видаються у порядку, встановленому Кабінетом Міністрів України.
Ліцензування освітньої діяльності ВНЗ здійснюється перед початком підготовки фахівців за напрямом, спеціальністю.
Ліцензування - процедура визнання спроможності ВНЗ певного типу розпочати освітню діяльність, пов`язану із здобуттям вищої освіти та кваліфікації, відповідно до вимог стандартів вищої освіти, а також до державних вимог щодо кадрового, науково-методичного та матеріально-технічного забезпечення.
Міністерство освіти і науки України на підставі заяви ВНЗ про проведення ліцензійної експертизи у двомісячний термін приймає рішення про видачу ліцензії або про відмову у ЇЇ видачі.
Обов`язковою умовою видачі ліцензії вищим навчальним закладам є наявність у них необхідної матеріально-технічної, науково-методичної та інформаційної бази, бібліотеки, науково-педагогічних кадрів за нормативами, що встановлює МОН України.
Вищому навчальному закладу, що успішно пройшов ліцензійну експертизу, видається ліцензія на освітню діяльність, як правило, на термін завершення циклу підготовки фахівців за напрямом, спеціальністю, але не менше ніж на три роки. Продовження терміну дії ліцензії здійснюється у порядку, встановленому для її одержання. Із дня прийняття рішення про ліквідацію ВНЗ видана ліцензія втрачає чинність.
оищі навчальні заклади, що мають ліцензії, вносяться МОН ^країни до Державного реєстру вищих навчальних закладів.
Наприкінці терміну дії ліцензії через процедуру акредитації визначається відповідність рівня підготовки фахівців за ліцензованими спеціальностями.
Акредитація   -   процедура  надання  вищому  навчальному  закладу
вного типу права проводити освітню діяльність, пов`язану із здобуттям
Щоі освіти та кваліфікації, відповідно до вимог стандартів вищої освіти,
акож до державних вимог щодо кадрового,  науково-методичного та
матеріально-технічного забезпечення.
',
				'number' => 4,
				'topic_id' => 4,
			];
		
		$arr[] = [
				'name' => '4.5. Суб`єкти навчально-виховного процесу',
				'content' => 'Особами, які навчаються у вищих навчальних закладах, є студенти (слухачі), курсанти, екстерни, асистенти-стажисти, інтерни, клінічні ординатори, здобувачі, аспіранти (ад`юнкти) та докторанти.
Студент (слухач) - особа, яка в установленому порядку зарахована до ВНЗ і навчається за денною (очною), вечірньою або заочного, дистанційною формами навчання з метою здобуття певних освітнього та освітньо-кваліфікаційного рівнів.
Курсант - особа, яка в установленому порядку зарахована до військового ВНЗ і навчається з метою здобуття певних освітнього та освітньо-кваліфікаційного рівнів.
екстерн   -   особа,   яка   в   установленому   порядку   зарахована   до
ВНЧ має    відповідний    освітній,    освітньо-кваліфікаційний    рівень    і
вчається за екстернатною формою навчання з метою здобуття певних Ітнього та освітньо-кваліфікаційного рівнів. Асистент-стажист - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень магістра або спеціаліста, навчається в асистентурі (стажування) ВНЗ мистецького профілю з метою удосконалення творчої майстерності.
Інтерн - особа, яка має повну вищу освіту і освітньо-кваліфікаційний рівень спеціаліста медичного або фармацевтичного спрямування, навчається з метою отримання кваліфікації лікаря або провізора певної спеціальності відповідно до переліку лікарських або провізорських посад.
Клінічний ординатор - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень спеціаліста або магістра медичного спрямування та кваліфікацію лікаря певної спеціальності відповідно до переліку лікарських посад, навчається з метою поглиблення професійних знань, підвищення рівнів умінь та навичок лікаря-спеціаліста.
Здобувач - особа, яка прикріплена до аспірантури або докторантури ВНЗ або наукової установи і готує дисертацію на здобуття наукового ступеня кандидата наук без навчання в аспірантурі, або особа, яка має науковий ступінь кандидата наук і готує дисертацію на здобуття наукового ступеня доктора наук без перебування в докторантурі.
Аспірант (ад`юнкт) - особа, яка має повну вищу освіту та освітньо-кваліфікаційний рівень магістра або спеціаліста, навчається в аспірантурі (ад`юнктурі) ВНЗ або наукової установи для підготовки дисертації на здобуття наукового ступеня кандидата наук.
Докторант - особа, яка має науковий ступінь кандидата наук і зарахована до докторантури для підготовки дисертації на здобуття наукового ступеня доктора наук.

',
				'number' => 5,
				'topic_id' => 4,
			];
        
		 DB::table('pages')->insert($arr);
    }
}
