@extends (env('THEME').'.layouts.site')

@section('header')
	{!! $header !!}
@endsection

@section('content')
<section class="content_section">
	<img class="image_page middle-width" src="{{ asset(env('THEME')) }}/img/main_theme.jpg" alt="Education">
	<h2 class="header_page">Добро пожаловать в электронно образовательную систему EES Fit</h2>
	<p class="text_page">Електронно-освітня система EES Fit - дипломний проект магістра Катеруші Р.К. Дана версія веб-додатку містить мінімальний, необхідний для використання, функціонал, достатній для вивчення більшості інструментів фреймворку Laravel, та формування наочного уявлення про розроблювану електронно-освітню систему.</p>
	<p class="text_page">Задля введення системи у експлуатацію необхідно суттєво удосконалити систему безпеки додатку, поширити функціонал систем тестування та збору статистики, створити україномовну локалізацію, написати frontend-частину та виправити декілька сотень нескладних, але ресурсоємких недоліків ;)</p>
</section>
@endsection
